# Chloe deBeus - 4.5_Consistency Checks

## Practicing mixed data types

In [1]:
#creating dataframe
import pandas as pd
import numpy as np
import os

df_test = pd.DataFrame()
df_test['columnOne'] = ['a','b',1, True]
df_test['columnTwo'] = [1, 2, 3, 4]
df_test

  columnOne  columnTwo
0         a          1
1         b          2
2         1          3
3      True          4

In [3]:
#code to check if it's a mixed column
#for loop
for col in df_test.columns.tolist():
    mixed_length = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_test[mixed_length]) > 0:
        print(col, 'is mixed')
    else:
        print(col, 'not problematic')
        #printed the problematic column name

columnOne is mixed
columnTwo not problematic

In [4]:
#changing the column type based on the decision of what the majority is
df_test['columnOne'] = df_test['columnOne'].astype('str')

In [5]:
print(df_test['columnOne'].dtype)
print(df_test.dtypes)

object
columnOne    object
columnTwo     int64
dtype: object

In [2]:
mainPath = r'C:\Users\18286\Documents\Career Foundry\05_2023_Instacart Basket Analysis'
#bring in products csv and generally explore
df_products = pd.read_csv(os.path.join(mainPath, '02 Datasets', 'Original data', 'products.csv'), index_col = False)

In [7]:
df_products.isnull().sum()
# the sum function here adds it up for us instead of the table

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

### There are 16 missing pieces within product_name

In [8]:
df_products.isnull()
# shows the actual table of true and false whether there is a null there

       product_id  product_name  aisle_id  department_id  prices
0           False         False     False          False   False
1           False         False     False          False   False
2           False         False     False          False   False
3           False         False     False          False   False
4           False         False     False          False   False
...           ...           ...       ...            ...     ...
49688       False         False     False          False   False
49689       False         False     False          False   False
49690       False         False     False          False   False
49691       False         False     False          False   False
49692       False         False     False          False   False

[49693 rows x 5 columns]

In [9]:
#create a subset of those that are missing
products_nan = df_products[df_products['product_name'].isnull() == True]
products_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [12]:
df_products['product_name'].mode()
#would make sense if there wasn't the outside role of the department...
#string values should not be imputed

0                              Adore Forever Body Wash
1                 Black House Coffee Roasty Stout Beer
2                    Fiber 4g Gummy Dietary Supplement
3    Gluten Free Organic Peanut Butter & Chocolate ...
4                                           Ranger IPA
Name: product_name, dtype: object

In [13]:
df_products.shape

(49693, 5)

In [6]:
df_products_clean = df_products[df_products['product_name'].isnull() == False]
print(df_products_clean)
print(df_products_clean.shape)

       product_id                                       product_name  \
0               1                         Chocolate Sandwich Cookies
1               2                                   All-Seasons Salt
2               3               Robust Golden Unsweetened Oolong Tea
3               4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4               5                          Green Chile Anytime Sauce
...           ...                                                ...
49688       49684          Vodka, Triple Distilled, Twist of Vanilla
49689       49685                 En Croute Roast Hazelnut Cranberry
49690       49686                                   Artisan Baguette
49691       49687         Smartblend Healthy Metabolism Dry Cat Food
49692       49688                             Fresh Foaming Cleanser

       aisle_id  department_id  prices
0            61             19     5.8
1           104             13     9.3
2            94              7     4.5
3            38              1    10.5
4             5             13     4.3
...         ...            ...     ...
49688       124              5     5.3
49689        42              1     3.1
49690       112              3     7.8
49691        41              8     4.7
49692        73             11    13.5

[49677 rows x 5 columns]
(49677, 5)

#### There is a difference of 16 rows

In [7]:
df_products.dropna(inplace = True)
df_products.shape

(49677, 5)

In [8]:
products_duplicates = df_products[df_products.duplicated()]
products_duplicates

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [26]:
#the code to drop duplicates (the exact same data points in all columns)
df_products_clean = df_products.drop_duplicates()
df_products_clean

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3
...,...,...,...,...,...
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

In [27]:
print(df_products_clean.shape)

(49672, 5)

In [28]:
df_products_clean.to_csv(os.path.join(mainPath, '02 Datasets', 'Clean Data', 'products_wrangled.csv'))

# Task 4.5

### Step Two

In [9]:
# bringing in order CSV 
df_orders = pd.read_csv(os.path.join(mainPath, '02 Datasets', 'Original data', 'orders.csv'), index_col = False)
df_orders.describe()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [10]:
df_orders.shape

(3421083, 7)

#### Just ensure that since it goes from 0 - 6 that all 7 values are there for days of the week. Same with hours, 0 - 23

In [11]:
df_orders.dtypes

order_id                    int64
user_id                     int64
eval_set                   object
order_number                int64
order_dow                   int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

In [12]:
#converting to strings from int
df_orders = df_orders.astype({'order_id':'object', 'user_id':'object'})
df_orders.dtypes

order_id                   object
user_id                    object
eval_set                   object
order_number                int64
order_dow                   int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

### Step Three

In [51]:
#finding mixed-type data
for col in df_orders.columns.tolist():
    mixed_length = (df_orders[[col]].applymap(type) != df_orders[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_orders[mixed_length]) > 0:
        print(col, 'is mixed')
    else:
        print(col, 'not problematic')
#I ran the else to see with my own eyes the proof that the others are checked and indeed not mixed

order_id not problematic
user_id not problematic
eval_set not problematic
order_number not problematic
order_dow not problematic
order_hour_of_day not problematic
days_since_prior_order not problematic

In [52]:
#checking the same for products of mixed-type
for col in df_products.columns.tolist():   
    mixed_length = (df_products[[col]].applymap(type) != df_products[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_products[mixed_length]) > 0:
        print(col, 'is mixed')
    else:
        print(col, 'not problematic')

product_id not problematic
product_name not problematic
aisle_id not problematic
department_id not problematic
prices not problematic

### Step Four

#### No mixed-type data in products nor orders, so no need to fix

### Step Five - missing values

In [53]:
#looking for missing values
df_orders.isnull().sum()

order_id                       0
user_id                        0
eval_set                       0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [57]:
#looks like there is a lot in since_prior_order, so let's check that out
orders_nan = df_orders[df_orders['days_since_prior_order'].isnull() == True]
orders_nan

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
11,2168274,2,prior,1,2,11,NaN
26,1374495,3,prior,1,1,14,NaN
39,3343014,4,prior,1,6,11,NaN
45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,969311,206205,prior,1,4,12,NaN
3420934,3189322,206206,prior,1,3,18,NaN
3421002,2166133,206207,prior,1,6,19,NaN
3421019,2227043,206208,prior,1,1,15,NaN
3421069,3154581,206209,prior,1,3,11,NaN

#### seeing the type of variable it is, these are customers that are ordering for the first time... they have no record of previous orders they should not be deleted nor imputed, we need a flag variable that will mark new customers from return customers

### Step Six - address missing values

In [68]:
#creating a new column 'new customer' to show whether or not they are (1) or aren't (0)
df_orders['new_customer'] = df_orders['days_since_prior_order'].isnull().astype(int)

In [67]:
df_orders

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,new_customer
0,2539329,1,prior,1,2,8,NaN,1
1,2398795,1,prior,2,3,7,15.0,0
2,473747,1,prior,3,3,12,21.0,0
3,2254736,1,prior,4,4,7,29.0,0
4,431534,1,prior,5,4,15,28.0,0
...,...,...,...,...,...,...,...,...
3421078,2266710,206209,prior,10,5,18,29.0,0
3421079,1854736,206209,prior,11,4,10,30.0,0
3421080,626363,206209,prior,12,1,12,18.0,0
3421081,2977660,206209,prior,13,1,12,7.0,0
3421082,272231,206209,train,14,6,14,30.0,0

### Step Seven - checking for duplicates

In [70]:
orders_duplicates = df_orders[df_orders.duplicated()]
orders_duplicates

Empty DataFrame
Columns: [order_id, user_id, eval_set, order_number, order_dow, order_hour_of_day, days_since_prior_order, new_customer]
Index: []

#### There are no duplicates

### Step Eight
#### There is no need to address duplicates as there are not any in the orders

### Step Nine - export

In [71]:
df_orders.to_csv(os.path.join(mainPath, '02 Datasets', 'Clean Data', 'orders_wrangled.csv'))